import datetime

def conver(dic):
    weekday = ["mon","tue","wed","thu","fri","sat","sun"]
    start_time = ["0830","0920","1025","1115","1320","1410","1515","1605","1730","1820","1910","2000"]
    end_time = ["0915","1005","1110","1120","1405","1455","1600","1650","1815","1905","1955","2045"]

    start_day = datetime.date(2020,2,17) #学期开始 周一

    courses = [{"summary": value[0].split('\n')[0].split('(')[0],
                "start": start_time[int(key[2:].split('_')[0])%12],
                "end": end_time[int(key[2:].split('_')[0])%12] if value[-1] is None else end_time[int(key[2:].split('_')[0])%12+1],
                "location": value[0].split('\n')[-1].replace('(', '').replace(')', '').split(',')[-1], 
                "description": value[0].split('\n')[0].split('(')[-1].replace('(', '').replace(')', '')+"老师喊你来上课啦",
                "weekday" : weekday[int(key[2:].split('_')[0])//12],
                "week" :  value[0].split('\n')[-1].replace('(', '').replace(')', '').split(',')[0]
                } 
                for key,value in dic.items()]

    # FIXME: 判断一下location和week是否相等，然后混合。
    
    with open('table.txt','w') as f:
        for table in courses:
            start_week = table['week'].split('-')[0]
            if '单' in start_week:
                start_week = int(start_week[1:])-1
                step = 2
            elif '双' in start_week:
                start_week = int(start_week[1:])-1
                step = 2
            else:
                start_week = int(start_week)-1
                step = 1
            
            end_week = int(table['week'].split('-')[-1])

            for i in range(start_week,end_week,step):
                day = start_day+datetime.timedelta(7*i+weekday.index(table['weekday']))
                start = day.strftime("%Y%m%d") + 'T'+ table['start'] + '00'
                end = day.strftime("%Y%m%d") + 'T' + table['end'] + '00'
                info = start+','+end+','+table['summary']+','+table['location']+','+table['description']+'\n'
                f.write(info)

if __name__ == '__main__':
    dic = {'TD60_0': ('电子系统设计与实践(2607155.01) (黄琼)\n(19,电计楼B302)', None), 
        'TD61_0': ('智能互联技术实践(2607219.02) (仝明磊,刘洪利,贺雪晨)\n(20,电计楼B207)', None),
        'TD73_0': ('信息系统设计与实践B(2607196.02) (沈文忠)\n(19,电计楼B205)', None), 
        'TD62_0': ('嵌入式智能系统设计(2607230.01) (刘丹丹,孟逢逢,贺雪晨,孙锦中)\n(20,电计楼B205)', None), 
        'TD16_0': ('形势与政策(3)(6000022.11) (崔释匀)\n(单11-15)', '2')}

    dic = {'TD0_0': ('大学英语B(3)(2900102.15) (谢华)\n(1-16,(临港)二教203)', '2'), 
            'TD12_0': ('大学物理B(2)(2800022.01) (李鹏飞)\n(双2-16,(临港)二教506)\n模拟电子技术(2600015.02) (刘洪利)\n(单1-15,(临港)一教107)', '2'), # FIXME: 将两课分开
            'TD24_0': ('物理实验(2)(2800024.02) (陈东生)\n(3-14,物理实验室1)', '2'), 
            'TD36_0': ('单片机与接口技术A(2607203.01) (刘丹丹)\n(1-16,(临 港)二教506)', '2'), 
            'TD48_0': ('大学物理B(2)(2800022.01) (李鹏飞)\n(1-16,(临港)二教506)', '2'), 
            'TD61_0': ('电子电路设计与调试(2600093.02) (江超)\n(4-16,电计楼B307)', None),
            'TD2_0': ('电路分析A(2)(2600080.01) (赵萍)\n(1-16,(临港)二教302)', '2'), 
            'TD14_0': ('电子测试与实验技术(模拟)(2600020.01) (刘洪利)\n(双2-16,电计楼B104)', '2'), 
            'TD26_0': ('体育(3)(7000003.41) (颜中杰)\n(1-16,(临港)临港操场二)', '2'), 
            'TD38_0': ('概率论(2800009.09) (王焱平)\n(1-16,(临港)三教511)', '2'), 
            'TD50_0': ('单片机与接口技术A(2607203.01) (刘丹丹)\n(1-16,(临港)二教506)', '2'), 
            'TD63_0': ('应用电子设计(2607209.02) (边后琴)\n(19-20,(临港)电信实验室2)', None), 
            'TD4_0': ('模拟电子技术(2600015.02) (刘洪利)\n(1-15,(临港)一教101)\n模拟电子技术(2600015.02) (刘洪利)\n(16,(临港)电信实验室3)', '2'), 
            'TD28_0': ('大学英语B(3)(2900102.15) (谢华)\n(1-16,(临港)二教203)', '2'), 
            'TD6_0': ('马克 思主义基本原理(6000023.01) (张贵红)\n(1-16,(临港)一教101)', '2'),
            'TD42_0': ('SOPC应用开发(2607194.01) (秦伦明)\n(1-16,电计楼B302)', '2'), 
            'TD8_0': ('电力企业文化概论(6000169.01) (焦娅敏)\n(4-14,(临港)一教101)', '2'), 
            'TD44_0': ('数据库基础与应用(3100006.01) (羌亮)\n(4-9,(临港)一教408第四机房)', '2'), 
            'TD10_0': ('电力企业文化概论(6000169.01) ( 焦娅敏)\n(4-13,(临港)一教101)', None), 
            'TD46_0': ('数据库基础与应用(3100006.01) (羌亮)\n(4-7,(临港)一教408第四机房)', None), 
            'TD58_0': ('基础生命科学(6100074.01) (线上教师（超星）)\n(19)', None)
            }
    conver(dic)